In [106]:
import pandas as pd
import sqlite3
from datetime import datetime, date

conn = sqlite3.connect('lahman.sqlite')

query = "SELECT * FROM sqlite_master;"

df_schema = pd.read_sql_query(query, conn)

df_schema.tbl_name.unique()

array(['allstarfull', 'appearances', 'awardsmanagers', 'awardsplayers',
       'awardssharemanagers', 'awardsshareplayers', 'batting',
       'battingpost', 'collegeplaying', 'divisions', 'fielding',
       'fieldingof', 'fieldingofsplit', 'fieldingpost', 'halloffame',
       'homegames', 'leagues', 'managers', 'managershalf', 'parks',
       'people', 'pitching', 'pitchingpost', 'salaries', 'schools',
       'seriespost', 'teams', 'teamsfranchises', 'teamshalf'],
      dtype=object)

#### Understanding what's in different tables

In [108]:
query = "SELECT * FROM people"

check_table = pd.read_sql_query(query, conn)
check_table.head(10)

,playerID,birthYear,birthMonth,birthDay,birthCountry,birthState,birthCity,deathYear,deathMonth,deathDay,...,bats,throws,debut,finalGame,retroID,bbrefID,birth_date,debut_date,finalgame_date,death_date
0,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,R,R,2004-04-06,2015-08-23,aardd001,aardsda01,1981-12-27,2004-04-06,2015-08-23,None
1,aaronha01,1934.0,2.0,5.0,USA,AL,Mobile,NaN,NaN,NaN,...,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01,1934-02-05,1954-04-13,1976-10-03,None
2,aaronto01,1939.0,8.0,5.0,USA,AL,Mobile,1984.0,8.0,16.0,...,R,R,1962-04-10,1971-09-26,aarot101,aaronto01,1939-08-05,1962-04-10,1971-09-26,1984-08-16
3,aasedo01,1954.0,9.0,8.0,USA,CA,Orange,NaN,NaN,NaN,...,R,R,1977-07-26,1990-10-03,aased001,aasedo01,1954-09-08,1977-07-26,1990-10-03,None
4,abadan01,1972.0,8.0,25.0,USA,FL,Palm Beach,NaN,NaN,NaN,...,L,L,2001-09-10,2006-04-13,abada001,abadan01,1972-08-25,2001-09-10,2006-04-13,None
5,abadfe01,1985.0,12.0,17.0,D.R.,La Romana,La Romana,NaN,NaN,NaN,...,L,L,2010-07-28,2019-09-28,abadf001,abadfe01,1985-12-17,2010-07-28,2019-09-28,None
6,abadijo01,1850.0,11.0,4.0,USA,PA,Philadelphia,1905.0,5.0,17.0,...,R,R,1875-04-26,1875-06-10,abadj101,abadijo01,1850-11-04,1875-04-26,1875-06-10,1905-05-17
7,abbated01,1877.0,4.0,15.0,USA,PA,Latrobe,1957.0,1.0,6.0,...,R,R,1897-09-04,1910-09-15,abbae101,abbated01,1877-04-15,1897-09-04,1910-09-15,1957-01-06
8,abbeybe01,1869.0,11.0,11.0,USA,VT,Essex,1962.0,6.0,11.0,...,R,R,1892-06-14,1896-09-23,abbeb101,abbeybe01,1869-11-11,1892-06-14,1896-09-23,1962-06-11
9,abbeych01,1866.0,10.0,14.0,USA,NE,Falls City,1926.0,4.0,27.0,...,L,L,1893-08-16,1897-08-19,abbec101,abbeych01,1866-10-14,1893-08-16,1897-08-19,1926-04-27

<br>

#### 1. What was the total spent on salaries by each team, each year?

In [9]:
query = """
SELECT salaries.yearID, teams.name AS Team_Name, sum(salaries.salary) as Total_Salaries 
FROM salaries LEFT JOIN teams
ON salaries.teamID = teams.teamID
GROUP BY salaries.yearID, teams.name
"""

salary_team_year = pd.read_sql_query(query, conn)
salary_team_year

      yearID             Team_Name  Total_Salaries
0       1985        Atlanta Braves    7.995780e+08
1       1985     Baltimore Orioles    7.630070e+08
2       1985      Boston Americans    7.628292e+07
3       1985        Boston Red Sox    1.220527e+09
4       1985     California Angels    4.616926e+08
...      ...                   ...             ...
1436    2016        Tampa Bay Rays    6.851677e+08
1437    2016         Texas Rangers    8.449859e+09
1438    2016     Toronto Blue Jays    5.964173e+09
1439    2016  Washington Nationals    2.124790e+09
1440    2016   Washington Senators    1.133221e+09

[1441 rows x 3 columns]

<br>

#### 2. What is the first and last year played for each player?

In [20]:
query = """
WITH first_last AS (
SELECT playerID, min(yearID) as First_Year, max(yearID) as Last_Year
FROM fielding
GROUP BY playerID)

SELECT people.nameFirst, people.nameLast, first_last.First_Year, first_last.Last_Year
FROM first_last LEFT JOIN people
ON first_last.playerID = people.playerID
"""

first_last_year = pd.read_sql_query(query, conn)
first_last_year

      nameFirst  nameLast  First_Year  Last_Year
0         David   Aardsma        2004       2015
1          Hank     Aaron        1954       1976
2        Tommie     Aaron        1962       1971
3           Don      Aase        1977       1990
4          Andy      Abad        2001       2003
...         ...       ...         ...        ...
19486     Frank      Zupo        1957       1961
19487      Paul   Zuvella        1982       1991
19488    George  Zuverink        1951       1959
19489     Dutch  Zwilling        1910       1916
19490      Tony      Zych        2015       2017

[19491 rows x 4 columns]

<br>

#### 3. Who has played the most all star games?

In [32]:
query = """

WITH allstar AS (
SELECT playerID, COUNT(*) as Game_Count
FROM allstarfull
GROUP BY playerID)

SELECT people.nameFirst, people.nameLast, allstar.Game_Count
FROM allstar LEFT JOIN people
ON allstar.playerID = people.playerID
INNER JOIN 
    (SELECT playerID, MAX(Game_Count) OVER () AS Max_Games
    FROM allstar) maxgames
    ON allstar.playerID = maxgames.playerID and allstar.Game_Count = maxgames.Max_Games
"""

all_star_games = pd.read_sql_query(query, conn)
all_star_games

  nameFirst nameLast  Game_Count
0      Hank    Aaron          24
1    Willie     Mays          24
2      Stan   Musial          24

##### Answer: There is a three way tie between who played the most all start games - Hank Aaron, Willie Mays, and Stan Musial

<br>

#### 4. Which school has generated the most distinct players?

In [42]:
query = """

SELECT name_full AS School, COUNT(DISTINCT playerID) as Game_Count
FROM collegeplaying LEFT JOIN schools
ON collegeplaying.schoolID = schools.schoolID
GROUP BY name_full 
ORDER BY COUNT(DISTINCT playerID) DESC
LIMIT 5
"""

school = pd.read_sql_query(query, conn)
school

                              School  Game_Count
0      University of Texas at Austin         107
1  University of Southern California         105
2           Arizona State University         101
3                Stanford University          86
4             University of Michigan          76

##### Answer: The University of Texas at Austin has generated the most distinct players

<br>

#### 5. Which players have the longest career? Assume that the debut and finalGame columns comprise the start and end, respectively, of a player's career.

In [136]:
query = """


SELECT nameFirst, nameLast, DATE(debut) AS debut, DATE(finalGame) AS finalGame,
Cast ((JulianDay(finalGame) - JulianDay(debut)) As Integer) AS DiffDate
FROM people
ORDER BY DiffDate DESC

"""

school = pd.read_sql_query(query, conn)
school.head()

  nameFirst  nameLast       debut   finalGame  DiffDate
0      Nick   Altrock  1898-07-14  1933-10-01   12862.0
1       Jim  O'Rourke  1872-04-26  1904-09-22   11836.0
2    Minnie    Minoso  1949-04-19  1980-10-05   11492.0
3   Charley   O'Leary  1904-04-14  1934-09-30   11126.0
4     Arlie    Latham  1880-07-05  1909-09-30   10678.0

<br>

#### 6. What is the distribution of debut months?

In [138]:
query = """


SELECT nameFirst, nameLast, 
strftime('%m', debut) as Month
FROM people


"""

school = pd.read_sql_query(query, conn)
school.head()

  nameFirst nameLast Month
0     David  Aardsma    04
1      Hank    Aaron    04
2    Tommie    Aaron    04
3       Don     Aase    07
4      Andy     Abad    09

<br>

#### 7. What is the effect of table join order on mean salary for the players listed in the main (master) table?

In [88]:
query = """
SELECT people.playerID, avg(salaries.salary) as AVG_Salaries 
FROM salaries LEFT JOIN people
ON salaries.playerID = people.playerID
GROUP BY people.playerID
"""

salary_first = pd.read_sql_query(query, conn)
salary_first

       playerID  AVG_Salaries
0     aardsda01  1.322821e+06
1      aasedo01  5.750000e+05
2      abadan01  3.270000e+05
3      abadfe01  7.532800e+05
4     abbotje01  2.462500e+05
...         ...           ...
5144  zumayjo01  7.011667e+05
5145  zuninmi01  5.138000e+05
5146  zupcibo01  1.436667e+05
5147  zuvelpa01  1.450000e+05
5148   zychto01  5.110000e+05

[5149 rows x 2 columns]

In [89]:
query = """
SELECT people.playerID, avg(salaries.salary) as AVG_Salaries 
FROM people LEFT JOIN salaries
ON people.playerID = salaries.playerID
GROUP BY people.playerID
"""

people_first = pd.read_sql_query(query, conn)
people_first

        playerID  AVG_Salaries
0      aardsda01  1.322821e+06
1      aaronha01           NaN
2      aaronto01           NaN
3       aasedo01  5.750000e+05
4       abadan01  3.270000e+05
...          ...           ...
19873   zupofr01           NaN
19874  zuvelpa01  1.450000e+05
19875  zuverge01           NaN
19876  zwilldu01           NaN
19877   zychto01  5.110000e+05

[19878 rows x 2 columns]

##### Answer: There are some players with no salary information. When the left join is done on salaries, those players disappear out of the resulting data set since they aren't in the salaries table and that left join will only keep rows in the salaries table. When the left join is done on the people table, the players stay in the resulting data set and just have null values since they are in the people table.